import { chunk } from "es-toolkit";
import { chunk_1, chunk_2, chunk_3 } from "./code";

describe("chunk", () => {
	it("지정된 크기의 작은 배열들로 배열을 분할해야 합니다.", () => {
		expect(chunk([1, 2, 3, 4, 5], 2)).toEqual([[1, 2], [3, 4], [5]]);
		expect(chunk_1(["a", "b", "c", "d", "e", "f", "g"], 3)).toEqual([
			["a", "b", "c"],
			["d", "e", "f"],
			["g"],
		]);
		expect(
			chunk_2(
				[
					[1, 2],
					[3, 4],
					[5, 6],
					[7, 8],
				],
				2
			)
		).toEqual([
			[
				[1, 2],
				[3, 4],
			],
			[
				[5, 6],
				[7, 8],
			],
		]);
		expect(
			chunk_3(
				[
					[
						[1, 2],
						[3, 4],
					],
					[
						[5, 6],
						[7, 8],
					],
					[
						[9, 10],
						[11, 12],
					],
					[
						[13, 14],
						[15, 16],
					],
				],
				2
			)
		).toEqual([
			[
				[
					[1, 2],
					[3, 4],
				],
				[
					[5, 6],
					[7, 8],
				],
			],
			[
				[
					[9, 10],
					[11, 12],
				],
				[
					[13, 14],
					[15, 16],
				],
			],
		]);
	});
});
